package work05.rectangle;

/*Написати   клас Rectangle , в якому буде описано поля : довжина, ширина. Описати   дані поля в конструкторі. 
 * Створити конструктор з параметрами і без   параметрів. Написати методи, які будуть розраховувати площу та периметр.
 * В Main класі продемонструвати створення об’єктів використовуючи два   конструктори. Вивести на консоль площу і 
 * периметр прямокутника. Вивід на   консолі повинен мати наступний вигляд: «Площа прямокутника = тут буде площа », 
 * «Периметр прямокутника = тут буде периметр». 
 */
public class Main {

	public static void main(String[] args) {
		Rectangle rectangle=new Rectangle(5,6);
		Rectangle rectangle2=new Rectangle();
	}

}
