package work05.car;
/*Написати   клас Машина, додати наступні поля: колір, марка, розхід, обʼєм  пального  в баці, пробіг. 
 * Написати метод: void drive(int km) — потрібно   розрахувати чи вистачить пального на поїздку по заданим 
 * даним, якщо   вистачить вивести скільки машина проїхала і загальний пробіг, якщо не   вистачить — вивести 
 * порахувати і вивести скільки машина змогла проїхати і   загальний пробіг, якщо пального не має вивести 
 * повідомлення про   необхідність заправити машину. В перших 2-х випадках зменшити обʼєм   пального на величину 
 * яка залежить від заданої довжини поїздки і розходу   пального. Написати метод: void reFuel(int fuelVolume). 
 * Написати метод:   void distance() який виводить данні про машину і пробіг. Можна дописати   машині любі 
 * необхідні поля, а також любу кількість конструкторів.
 */
public class Main {	

	public static void main(String[] args) {
		Car car=new Car("red", "Opel", 7);
	}
}
